swak4Foam/Examples/RegionSolvers/icoStructChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (0.04 0 0)
    (0.04 0.005 0)
    (0 0.005 0)
    (0 0 0.001)
    (0.04 0 0.001)
    (0.04 0.005 0.001)
    (0 0.005 0.001)
    (0 0.01 0)
    (0.04 0.01 0)
    (0.04 0.01 0.001)
    (0 0.01 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 20 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 10 11) (80 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces (
            (0 1 5 4)
        );
    }
    top {
        type mappedWall;
        faces (
            (8 11 10 9)
        );
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     bottom;
    }
    frontAndBack {
        type empty;
        faces (
            (0 3 2 1)
            (4 5 6 7)
            (3 8 9 2)
            (6 10 11 7)
        );
    }
    inlet {
        type patch;
        faces (
            (0 4 7 3)
            (8 3 7 11)
        );
    }
    outlet {
        type patch;
        faces (
            (2 6 5 1)
            (2 9 10 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
